<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"c6c3a6d144c4a8480f2f6dadaccc26b5a698aef2fe9d3589bf59e35fc0e422fc","plan_job_ref":"Job Test actions using target and replace #509 at https://github.com/dflook/terraform-github-actions/actions/runs/15363039464","plan_out_hash":"cf7a42d102b163ea59b6823d38d1a10ccbc8d4ab07731a24e1fdbcf9b9610b9c","plan_hash":"b4c707ec9e508ed34439632fe301f912ba2a842b25f6a5ffe928e6ad0488a4d2","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "YglpkMAkn9" -> (known after apply)
!~  foreach = "kKPFfGHmfb" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #509](https://github.com/dflook/terraform-github-actions/actions/runs/15363039464)